package LR7;

import java.util.ArrayList;
import java.util.List;

public class Main {
    public static void main(String[] args) {
        List<Автомобіль> автопарк = new ArrayList<>();
        автопарк.add(new Автомобіль("Volvo", 200, new Водій("Петро", 50, 20), 20000, 2008));
        автопарк.add(new Автомобіль("Toyota", 200, new Водій("Мстислав", 80, 25), 30000, 2018));
        автопарк.add(new Автомобіль("ВАЗ", 120, new Водій("Роджер", 25, 5), 5000, 1978));
        автопарк.add(new Автомобіль("Mercedes", 350, new Водій("Андрій", 100, 30), 50000, 2007));
        автопарк.add(new Автомобіль("KIA", 180, new Водій("Улан", 80, 15), 15000, 2017));
        автопарк.add(new Автомобіль("УАЗ", 320, new Водій("Святослав", 110, 40), 12000, 1971));
        автопарк.add(new Автомобіль("Skoda", 170, new Водій("Ірина", 90, 18), 22000, 2009));
        автопарк.add(new Автомобіль("КрАЗ", 405, new Водій("Анатолій", 180, 45), 100000, 1999));
        автопарк.add(new Автомобіль("КамАЗ", 380, new Водій("Моніка", 160, 35), 95000, 1986));
        автопарк.add(new Автомобіль("Citroen", 100, new Водій("Владислав", 120, 12), 25000, 2019));
        автопарк.add(new Автомобіль("ЗАЗ", 50, new Водій("Саят", 80, 10), 2000, 1966));

        // Ремонт половини автопарку
        for (int i = 0; i < автопарк.size() / 2; i++) {
            автопарк.get(i).збільшитиПотужність(10);
            автопарк.get(i).змінитиВодія(new Водій("НовийВодій" + (i + 1), 30, 10));
        }

        // Кожне друге авто збільшення потужності на 10% та ціни на 5%
        for (int i = 1; i < автопарк.size(); i += 2) {
            автопарк.get(i).збільшитиПотужність(10);
            автопарк.get(i).збільшитиЦіну(5);
        }

        // Перевірка стажу всіх водіїв
        for (Автомобіль авто : автопарк) {
            Водій водій = авто.отриматиВодія();
            if (водій.отриматиСтаж() < 5 && водій.отриматиВік() > 25) {
                водій.збільшитиСтаж();
            }
        }


        System.out.println("Завдання 1:");
        // Виклик таксі
        Автомобіль вибранеТаксі = Помічник.випадковеТаксі(автопарк);
        Помічник.таксіПрибуло(вибранеТаксі);

        System.out.println("\nЗавдання 2:");
        ТелефоннаКнига телКнига = new ТелефоннаКнига();

        // Додавання записів
        телКнига.додатиКонтакт("Іванов", "+380671234567");
        телКнига.додатиКонтакт("Петров", "+380931112233");
        телКнига.додатиКонтакт("Сидоров", "+380503334455");
        телКнига.додатиКонтакт("Мельник", "+380661223344");
        телКнига.додатиКонтакт("Ковальчук", "+380671112233");
        телКнига.додатиКонтакт("Ткачук", "+380931234567");
        телКнига.додатиКонтакт("Шевчук", "+380503332211");
        телКнига.додатиКонтакт("Кравчук", "+380661122334");
        телКнига.додатиКонтакт("Гащук", "+380672233445");
        телКнига.додатиКонтакт("Пінчук", "+380931112244");

        // Вивід всієї книги
        телКнига.вивестиКнигу();
        System.out.println("Кількість записів у книзі: " + телКнига.отриматиРозмір());

        // Пошук номера
        System.out.print("\nПошук за запитом Кравчук: ");
        телКнига.знайтиКонтакт("Кравчук");

        // Видалення контакту
        System.out.println("\nВидалення з телефонної книги контакту Пінчук: ");
        телКнига.видалитиКонтакт("Пінчук");

        // Перевірка наявності ключв після видалення
        System.out.println("\nЧи є у книзі Пінчук? " + телКнига.перевіритиПрізвище("Пінчук"));

        // Перевірка наявності ключа
        System.out.println("\nЧи є у книзі абонент 'Ковальчук'? " + телКнига.перевіритиПрізвище("Ковальчук"));

        // Перевірка наявності значення
        System.out.println("\nЧи є в книзі номер '+380503334455'? " + телКнига.перевіритиНомер("+380503334455"));

        // Вивід кількості записів
        System.out.println("\nКількість записів у книзі: " + телКнига.отриматиРозмір());
    }
}