package LR9;

public class обчисленняТеплоти{
    private static final double теплоємністьВоди = 4.18; // Дж/(г·°C) для води

    // Метод для обчислення теплоти
    public static double обчисленняТеплоти(double маса, double температураНагріву, double початковаТемпература) {
        // Формула для обчислення теплоти: Q = m * c * ΔT
        // m - маса, c - теплоємність, ΔT - зміна температури
        double deltaT = температураНагріву - початковаТемпература;
        return маса * теплоємністьВоди * deltaT;
    }
}